Revit 2027 API
OrdinateDimensionSetting.DimensionLineStyle Property
 Specifies the dimension line style.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public OrdinateDimensionLineStyle DimensionLineStyle { get; set; }
Public Property DimensionLineStyle As OrdinateDimensionLineStyle
	Get
	Set
public:
property OrdinateDimensionLineStyle DimensionLineStyle {
	OrdinateDimensionLineStyle get ();
	void set (OrdinateDimensionLineStyle value);
}
member DimensionLineStyle : OrdinateDimensionLineStyle with get, set
Property Value
OrdinateDimensionLineStyle
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
OrdinateDimensionSetting Class
Autodesk.Revit.DB Namespace